{
"home": {
	"title": "Lux Allowance - <b>Calculator</b>",
	"class": "luxallowance",
	"file": "lightallowance.json",
	"content": "[##]",
	"content right": ""
	},
"instructions": {
	"title": "Lux Allowance - <b>Instructions</b>",
	"content": "<div class=\"alert alert-warning\" role=\"alert\">\r\n  A general introduction to the tool, covering it general purpose is provided on the [About page|.\/about.html]. If you have any questions or suggestions relating to this tool please do post then through the GitHub Issues system [here|https:\/\/github.com\/jpadfield\/Lux-Allowance-Calculator\/issues].\r\n<\/div>\r\n\r\n<h3>Calculation Summary<\/h3>\r\n\r\n<p>The purpose of the Lux Allowance Calculator is to establish if a planned period of display can be accommodated based on a maximum permissible annual exposure allowance, or if adjustments will be required to ensure the displayed objects are not over exposed. This is achieved by calculating a possible allocated total of Lux Hrs, based on the selected dates, opening hours, and set points and then comparing it to the appropriate proportion of the select Annual Allowance.<\/p>\r\n\r\n<div class=\"alert col-md-12 alert-success\" role=\"alert\">\r\n  If the <b>Allocated total<\/b> of Lux Hrs is less than the maximum permissible <b>annual exposure allowance<\/b> the <b>Calculation Summary<\/b> section will be coloured green as shown here. \r\n  <br\/><br\/>\r\n  <ul>\r\n    <li>The first line of information will include the length of the selected display period and the maximum appropriate proportion of the select Annual Allowance. If the <b>Display Period<\/b> value is adjusted, additional information is provided to highlight any changes to the standard maximum allowance, see below.<\/li>\r\n    <li>The next line displays the total allocated Lux Hrs required for the display, as calculated by the tool, along with any remain lux allowance that could be used to accommodate the need for additional activities such as out of hours events.<\/li>\r\n    <li>The next three lines then provides details of how main actual hours of exposure the remaining allowance can accommodate, at 100%, 50% and 40% of the selected normal display levels. This has been included because out of hours events often require lower levels of light.<\/li>\r\n  <\/ul>  \r\n<\/div>\r\n\r\n<div class=\"alert col-md-12 alert-danger\" role=\"alert\">\r\n  If the <b>Allocated total<\/b> of Lux Hrs is greater than the maximum permissible <b>annual exposure allowance<\/b> the <b>Calculation Summary<\/b> section will be coloured red as shown here. This indicates that the current lighting plan will result in too much light exposure and either the lighting plan will need to be adjusted or some additional days of dark storage will need to be added to the length of the display period. \r\n  <br\/><br\/>\r\n  <ul>\r\n        <li>The first line of information will include the length of the selected display period and the maximum appropriate proportion of the select Annual Allowance. If the <b>Display Period<\/b> value is adjusted, additional information is provided to highlight any changes to the standard maximum allowance, see below.<\/li>\r\n    <li>The next line displays the total allocated Lux Hrs required for the display, as calculated by the tool.<\/li>\r\n    <li>The next line highlights <b>CAUTION - OVEREXPOSURE<\/b> and indicates how many extra Lux Hrs of exposure would be required.<\/li>\r\n    <li>The final line indicates how many extra additional or rest days of dark storage would need to be added to the length of the display period to accommodate the required extra exposure.<\/li>\r\n  <\/ul>  \r\n<\/div>\r\n\r\n\r\n<h3>Simple Calculations<\/h3>\r\n<p>General calculations can be carried out as follows:<\/p>\r\n\r\n<ul>\r\n  <li>Set the required <b>Start<\/b> and <b>End<\/b> dates but clicking on the date fields and selecting the required dates.<\/li>\r\n  <li>Select the appropriate <b>Opening Profile<\/b> which will define the required opening hours for the display period. (see below for working with <b>Custom<\/b> values.<\/li>\r\n  <li>Select the appropriate <b>Object Type<\/b>, this will determine the maximum annual lux allowance and set the various default Lux set points.<\/li>  \r\n  <li>The calculated number of Lux Hrs, based on the selection made, are displayed in the <b>Calculation Summary<\/b> section near the bottom of the page.<\/li>\r\n<\/ul>\r\n\r\n<h3>Sharing Results<\/h3>\r\n<p>The current dates, selections and settings can always be shared via the automatically updated <b>Shareable Link<\/b> near the bottom of the page. Each time any adjustments are made to the calculations shown on the page the underlying link is automatically updated. The link itself is slightly longer as all of the details on the page are compressed into the link itself rather than referencing any database.<\/p>\r\n\r\n<h3>Custom Opening Hours<\/h3>\r\n<p>The default tool provides two options for opening hours, based on those used at the National Gallery, London, but the tool also provides the option to define custom opening hours. The form provided, see below, allows users to define a default pair of display and operational hours values for a given week. The user can then add in additional rows to indicate if any of the days in the week deviate from this default. Please note that closure days can be indicated with a \"0\" value for the display hours value, but any exposure required for operational hours and the background level experienced while the room is closed will still count towards the allocated total for each each of the display period.<\/p>\r\n\r\n<figure class=\"figure\"><img src=\"graphics\/instructions_fig_01.png\" class=\"figure-img img-fluid rounded\" alt=\\\"An example of the form layout used to select custom opening hours.\"><figcaption class=\"figure-caption\">An example of the form layout used to select custom opening hours.<\/figcaption><\/figure>\r\n\r\n<ul>\r\n  <li>The default settings for <b>Custom Hours<\/b> included the default setting along with alternative setting for longer opening times on Friday and Saturday.<\/li>\r\n  <li>The values for the default setting can be edited as required.\r\n  <li>The values for the alternative days can also be edited or deleted as required.<\/li>\r\n  <li>The results displayed in the <b>Calculation Summary<\/b> will be automatically updated as changes are made to the custom opening hours.<\/li>\r\n<\/ul>\r\n\r\n<h3>Altering Lux Set-points and Limits<\/h3>\r\n<p>The figure below shows all of the various lux set-points and limits that can be changed to adjust the calculations. The default values for all of these fields are set by the <b>Object Type<\/b> drop down menu.<\/p>\r\n\r\n<figure class=\"figure\"><img src=\"graphics\/instructions_fig_02.png\" class=\"figure-img img-fluid rounded\" alt=\\\"An example of the form layout used to alter the various lux set-points and limits.\"><figcaption class=\"figure-caption\">An example of the form layout used to alter the various lux set-points and limits.<\/figcaption><\/figure>\r\n<ul>\r\n  <li>Select the required profile from the <b>Object Type<\/b> drop-down menu.<\/li>\r\n  <li>Three of the values, <b>Min Display Lux<\/b>, <b>Max Lux<\/b> and <b>Annual Allowance<\/b> are normally marked as read-only, with a grey background. If a user does need to change these values it can be done by selecting the <b>Special Light Sensitivity<\/b> object type.<\/li>\r\n  <li>The non-read only fields can all be edited as required, but please note the <b>Min Display Lux<\/b> and <b>Max Lux<\/b> field values will limit the numbers that can be entered into some of the other fields.<\/li>\r\n  <li>New field values will be taken into account when the user presses the <b>return<\/b> key or clicks anywhere else on the page.<\/li>\r\n  <li>Once you have edited a field and clicked somewhere else on the page the background colour of the field will change to indicate the change in value. Valid changes will be highlighted in yellow. However, when a change is requested that exceeds the relevant Max or Min values the entered value will be automatically changed to equal the relevant limit and the background will be flagged as red.<\/li>\r\n  <li>The <b>Display Period<\/b> field is discussed in more detail below.<\/li>  \r\n<\/ul>\r\n\r\n<h3>Display Period<\/h3>\r\n<p>The <b>Display Period<\/b> field, in the <b>Lux Set-points and Limits<\/b> section, allows the user to specifically plan for additional or rest days of dark storage on top of the defined display period. This is required for more light sensitive works that may not have a high enough exposure allowance to be displayed all of the time. If additional or rest days of dark storage are added, the total length length of time used to determine the proportion of the <b>annual exposure allowance<\/b> available for a given display event increases.<\/p>\r\n\r\n<p>For example (simplified for ease of explanation)<\/p>\r\n\r\n<ul>\r\n  <li>If an exhibition was planned to last for 6 months the lighting allowance for the exhibition would be half of the maximum annual allowance. So, for a <b>Medium Light Sensitive<\/b> object, like pastel drawing, with an annual allowance of 150,000 Lux Hrs, the exhibition allowance would be half of that at 75,000 Lux Hrs.<\/li>\r\n  <li>Now if, due to longer opening hours and the need for higher display lux levels, the six month exhibition actually needed the full 150,000 Lux Hrs a <b>Medium Light Sensitive<\/b> object would end up being over exposed.<\/li>\r\n  <li>If, as part of the exhibition plan, the <b>Medium Light Sensitive<\/b> object is actually put into dark storage for six months, before or after the exhibition, the exhibition allowance can be doubled as over the 12 month period of the exhibition and the dark storage the <b>Medium Light Sensitive<\/b> object would not exceed its maximum annual allowance.<\/li>\r\n  <li>In this case the exhibition period can be seen as being half, or 50%, of the total period of time being considered when calculating maximum exhibition allowance.<\/li>\r\n  <li>For this example the <b>Display Period<\/b> value in the <b>Lux Set-points and Limits<\/b> section can be set to <b>50<\/b> and the required number of days, in this case about 180, will be indicated in the <b>Calculation Summary<\/b>.<\/li>\r\n<\/ul>\r\n\r\n<p>This is a complex process to explain and calculate, potential improvements are being considered but thoughts and suggestions are welcome and can be posted through the GitHub Issues system [here|https:\/\/github.com\/jpadfield\/Lux-Allowance-Calculator\/issues].<\/p>\r\n\r\n<h3>Adding New Default Settings<\/h3>\r\n<p>For infrequent use the options for <b>Custom<\/b> opening hours and fully editable limits and set-points with <b>Special Light Sensitivity<\/b> objects can allow a wide range of users to exploit this tool. However, it has been suggested that, if users need to use the tool frequently then having to repeatedly make a wide range of similar adjustments to the provided default, every time the tool was used, would be less than ideal. Therefore, two options have been considered to allow users to add additional or new default settings.<\/p>\r\n\r\n<ul>\r\n  <li>The default setting are all stored in one configuration file called [lightallowance.json|https:\/\/raw.githubusercontent.com\/jpadfield\/Lux-Allowance-Calculator\/master\/build\/lightallowance.json] which can be found in the [build|https:\/\/github.com\/jpadfield\/Lux-Allowance-Calculator\/tree\/master\/build] folder.<\/li>\r\n  <li>This file is structured in a format called [JSON|https:\/\/en.wikipedia.org\/wiki\/JSON], which although a little tricky, is relatively human readable and the default setting could be edited as required if a users creates their own copy of the code.<\/li>\r\n  <li>New or additional default values can be added to the tool by either referencing an extra configuration file or by creating a new version of the system and editing the new <b>lightallowance.json<\/b> file.<\/li>\r\n<\/ul>\r\n\r\n<h4>Option 1: Reference an additional settings configuration file<\/h4>\r\n<ul>\r\n  <li>Additional information can be passed to web pages by adding information to the end of the page's URL.<\/li>\r\n  <li>The default URL for the main <b>Lux Allowance Calculator<\/b> is: [https:\/\/national-gallery.github.io\/Lux-Allowance-Calculator\/|https:\/\/national-gallery.github.io\/Lux-Allowance-Calculator\/]<\/li>\r\n  <li>To reference an additional web based configuration file it's own URL needs to be added to the end of the default URL by adding <b>?url=https:\/\/link\/address\/to\/the\/new\/file<\/b><\/li> \r\n  <li>An example additional [configuration file|https:\/\/national-gallery.github.io\/Lux-Allowance-Calculator\/?files\/example_config.json] has been included in the tool to demonstrate the process.<\/li>\r\n  <li>So the new full URL would be: [https:\/\/national-gallery.github.io\/Lux-Allowance-Calculator\/?url=https:\/\/national-gallery.github.io\/Lux-Allowance-Calculator\/files\/example_config.json|https:\/\/national-gallery.github.io\/Lux-Allowance-Calculator\/?url=https:\/\/national-gallery.github.io\/Lux-Allowance-Calculator\/files\/example_config.json].<\/li>\r\n  <li>This new URL can then just be book marked and used in the future and the additional configuration options will be added to the drop down menus every time.<\/li>\r\n  <li>If a user does not already have access to facilities to host their own additional web based configuration file, they could host it free on GitHub. Instructions for creating a repository on GitHub to host a file are relatively easy to find on [Google|https:\/\/www.google.com\/search?q=begginers+guide+to+creating+your+first+file+on+github&sxsrf=APwXEde39L2dZBonSfZt8iz29hFOJ6MlWQ%3A1683324934262&ei=BoBVZL7WD9b9gAanrZCYAw&ved=0ahUKEwi-8f2Fmt_-AhXWPsAKHacWBDMQ4dUDCA8&uact=5&oq=begginers+guide+to+creating+your+first+file+on+github&gs_lcp=Cgxnd3Mtd2l6LXNlcnAQAzIHCCEQoAEQCjIHCCEQoAEQCjoFCAAQogQ6CAghEBYQHhAdSgQIQRgAUABYtXhgxo8BaABwAXgAgAGmAYgB3A-SAQQyMy4ymAEAoAEBwAEB&sclient=gws-wiz-serp].<\/li>\r\n    \r\n<\/ul>\r\n\r\n<h4>Option 2: Copy the software and edit the settings<\/h4>\r\n<ul>\r\n  <li>The process of copying this software, which is hosted on GitHub, is called [Forking|https:\/\/docs.github.com\/en\/get-started\/quickstart\/fork-a-repo].<\/li>\r\n  <li>The <b>Lux Allowance Calculator<\/b> is based on a tool called [Simple Site|https:\/\/jpadfield.github.io\/simple-site] and the generic instructions for forking a <b>Simple Site<\/b> based system can be found [here|https:\/\/jpadfield.github.io\/simple-site\/howto.html].<\/li>  \r\n<\/ul>",
	"content right": ""
	},
"about": {
	"class": "list",
	"file": "logolist.json",
	"title": "Lux Allowance - <b>About</b>",
	"content": "<h3>What it does<\/h3>\r\n\r\n            <p>This [Lux allowance calculator|./] is used to check the calculated light exposure (in lux hours) for an object or group of objects for a selected period of display. This is based on three parameters:<\/p>\r\n\r\n            <ul>\r\n              <li>The type of objects being lit<\/li>\r\n              <li>The number of hours of light needed <\/li>\r\n              <li>The desired light (lux) levels<\/li>\r\n            <\/ul><p>The period of time can be adjusted, for example, a whole year or just for the duration of a temporary exhibition. The standard example calculations provided are is based on figures quoted by Thomson in The Museum Environment[@@Thomson, Garry, <i>The Museum Environment<\/i>, 2nd ed., London ; Butterworths, 1986, https:\/\/lccn.loc.gov\/85025446] and revisited by Saunders in Museum Lighting - A Guide for Conservators and Curators[@@Saunders, David, <i>Museum Lighting - A Guide for Conservators and Curators<\/i> , Los Angeles : The Getty Conservation Institute, 2020, pp. ??-??, https:\/\/lccn.loc.gov\/2019021273].<\/p>\r\n\r\n            <p>The output from the calculator represent the total light exposure for the selected period rather than just a target lux value. This total represents a planned cumulative light dose or ‘allowance’, that must accommodates normal opening hours, maintenance and security arrangements and out-of-hours activities. To keep the calculated light allowance below the limits given for a particular object type, it may be necessary to limit the number and duration of out-of-hours activities and\/or reduce the light levels for the duration of such activities.<\/p>\r\n\r\n            <p>Lighting guidelines, in the conservation literature, based on <b>cumulative light exposures<\/b> are generally averaged out over a typical year and can be combined with an <b>absolute maximum lux level<\/b> that should not be exceeded. In practice, these limits can be converted into <b>operational lux level limits (or lux set points)<\/b> adjusted to accommodate the required lighting duration. <b>When preparing a lighting plan, a range of values need to be considered<\/b>[@@All ultraviolet (UV) radiation with a wavelength of less than 380nm must also be excluded from the light, whether from natural or artificial sources.].<\/p> \r\n\r\n            <div class=\"alert alert-info\" role=\"alert\"><h4>The cumulative allowance will need to accommodate<\/h4><ul>\r\n              <li>Public opening hours<\/li>\r\n              <li>Lighting for additional planned out-of-hours events<\/li>\r\n              <li>Lighting for daily cleaning and maintenance <\/li>\r\n              <li>Lighting for overnight and security patrols <\/li>\r\n              <li>Additional lighting for unforeseen events<\/li>\r\n            <\/ul><\/div>\r\n\r\n            <h3>Why is it useful<\/h3>\r\n\r\n            <p>There is increasing pressure for collections and institutions to extend their opening hours and develop events and activities programmes, with the result that collections are being exposed to more light.  This directly results in increased cumulative exposure of a collection to the damaging effects of light and potentially accelerates deterioration processes. This increase in light exposure together with any increases in other ‘agents of deterioration’[@@ https:\/\/www.canada.ca\/en\/conservation-institute\/services\/agents-deterioration.html]* such as handling and movement of the collection, activity-induced vibration and increased levels of dirt and pest ingress, can lead to an increased overall risk and potential for damage, not just to collections but also to the building fabric and engineering systems providing environmental controls.<\/p>\r\n\r\n            <p>The original calculations (proposed by Thomson) were based on an average 200 lux for 8 hrs per day plus a low level of adventitious and security lighting for the remaining hours of each day (Thomson 1986, 30). However, many institutions are now open far longer, thus complicating these calculations, and a simple illuminance limit is no longer suitable.<\/p> \r\n\r\n            <p>Recent work in preventive conservation research has resulted in a re-examination of the recommendations for cumulative light exposure levels and limits. The overall recommended levels may have been reduced, relative to previous levels, meaning there are potentially less ‘light hours’ available for out-of-hours activities. This has the potential to impact on how the institutions operates, for example, limiting the number of out-of-hours activities possible with the light allowance available.<\/p>\r\n\r\n            <h3>Acknowledgements<\/h3>\r\n\r\n            <p>This tool was originally developed within the National Gallery, but its continue development and public presentation has also been supported by the EU H2020 [IPERION HS|https://www.iperionhs.eu/] project[@@IPERION-HS 'Integrating Platforms for the European Research Infrastructure ON Heritage Science', has received funding from the European Union's Horizon 2020 project call H2020-INFRAIA-2019-1, under GA No. 871034.].",
	"content right": ""		
	}
}
