{
"home": {
	"title": "Lux Allowance - <b>Calculator</b>",
	"class": "luxallowance",
	"file": "lightallowance.json",
	"content": "[##]",
	"content right": ""
	},
"instructions": {
	"title": "Lux Allowance - <b>Instructions</b>",
	"content": "<!-- @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ -->\r\n\r\n<h3>Using the Calculator<\/h3>\r\n\r\n<p>As explained on the [summary page|summary.html] the calculator has been designed to allow users to check if planned activities, <\/p>\r\n\r\n<h3>Updating the Form<\/h3>\r\n\r\n<p>More stuff<\/p>\r\n\r\n<!-- @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ -->",
	"content right": ""
	},
"about": {
	"title": "Lux Allowance - <b>About</b>",
	"content": "<h3>What it does<\/h3>\r\n\r\n            <p>This [Lux calculator|index.php] is used to calculate the light allowance (in lux hours) for an object or groups of objects for a selected period of display. This is based on three parameters:\r\n\r\n            <ul>\r\n              <li>The type of objects being lit<\/li>\r\n              <li>The number of hours needed to light the object<\/li>\r\n              <li>The desired light (lux) levels<\/li>\r\n            <\/ul><\/p>\r\n\r\n            <p>The period can be, for example, over one whole year or for the duration of a temporary exhibition. The standard example calculations provided are is based on figures quoted by Thomson in The Museum Environment[@@Thomson, Garry, <i>The Museum Environment<\/i>, 2nd ed., London ; Butterworths, 1986, pp. ??-??, https:\/\/lccn.loc.gov\/85025446] and revisited by Saunders in Museum Lighting - A Guide for Conservators and Curators[@@Saunders, David, <i>Museum Lighting - A Guide for Conservators and Curators<\/i> , Los Angeles : The Getty Conservation Institute, 2020, pp. ??-??, https:\/\/lccn.loc.gov\/2019021273].<\/p>\r\n\r\n            <p>The total from the calculator represent the maximum allowed light exposure for the period rather than just one a target lux value. This total is the cumulative light dose or ‘allowance’, that must accommodates normal opening hours, maintenance and security arrangements and out-of-hours activities. To keep within the permitted light allowance, it may be necessary to limit the number and duration of out-of-hours activities and\/or reduce the light levels for the duration of such activities.<\/p>\r\n\r\n            <p>Lighting guidelines based on <b>cumulative light exposures<\/b> are averaged out over a typical year and can be combined with an <b>absolute maximum lux level<\/b> that should not be exceeded. In practice, these limits can be converted into <b>operational lux level limits (or lux set points)<\/b> adjusted to accommodate the required lighting duration. <b>When preparing a lighting plan, all three of these values need to be considered<\/b>[@@All ultraviolet (UV) radiation with a wavelength of less than 380nm must be excluded from the light, whether from natural or artificial sources.]. This process works well as long as actual exposure times match those historically used to determine a typical year, however as opening hours are increased this relationship can break down.<\/p> \r\n\r\n            <div class=\"alert alert-info\" role=\"alert\"><h4>The cumulative allowance will need to accommodate<\/h4><ul>\r\n              <li>Public opening hours<\/li>\r\n              <li>Lighting for additional planned out-of-hours events<\/li>\r\n              <li>Lighting for daily cleaning and maintenance <\/li>\r\n              <li>Lighting for overnight and security patrols <\/li>\r\n              <li>Additional lighting for unforeseen events<\/li>\r\n            <\/ul><\/div>\r\n\r\n            <h3>Why is it useful<\/h3>\r\n\r\n            <p>There is increasing pressure for collections and institutions to extend their opening hours and develop events and activities programmes, with the result that collections are being exposed to more light.  This directly results in increased cumulative exposure of a collection to the damaging effects of light and potentially accelerates deterioration processes. This increase in light exposure together along with any increases in other ‘agents of deterioration’[@@ https:\/\/www.canada.ca\/en\/conservation-institute\/services\/agents-deterioration.html]* such as handling and movement of the collection, activity-induced vibration and increased levels of dirt and pest ingress, can lead to an increased overall risk and potential for damage, not just to collections but also to the building fabric and engineering systems providing environmental controls.<\/p>\r\n\r\n            <p>The original calculations (proposed by Thomson) were based on an average 200 lux for 8 hrs per day plus a low level of adventitious and security lighting for the remaining hours of each day (Thomson 1986, 30). However, many institutions are now open far longer, thus complicating these calculations, and a simple illuminance limit is no longer suitable.<\/p> \r\n\r\n            <p>Recent work in preventive conservation research has resulted in a re-examination of the recommendations for cumulative light exposure levels and limits. The overall recommended levels may have been reduced, relative to previous levels, meaning there are potentially less ‘light hours’ available for out-of-hours activities. This has the potential to impact on how the institutions operates, for example, with the number of out-of-hours activities possible with the light allowance available.<\/p>  ",
	"content right": ""		
	}
}
